#+setupfile: ~/github/darrenknewton.com/template.org
#+title:     Racket / Org-Mode Test
#+date:      <2023-10-13 Fri>
#+options:   title:nil

#+BEGIN_SRC elisp :exports results :results raw
  (regenerate-preamble-postamble)
  (make-metadata
   '(:title       "Racket / Org-Mode Test"
     :description "Testing Org-Mode / Babel with Racket"
     :date        "<2023-10-13 Fri>"
     :keywords    "racket org-mode emacs"
     :type        "article"
     :url         "test-a.html"
     :img-url     "http://darrennewton.com/img/circle.png"
     :img-type    "image/png"
     :img-width   "200"
     :img-height  "200"
     :img-alt     "Image of a circle, yo"))
#+END_SRC

*** Random figures in a table

#+BEGIN_SRC racket :noweb yes :exports results :results output raw verbatim :colnames '("a" "b" "c")
  (define (->cur n)
    (exact->inexact (/ n 100)))
  (displayln "| a | b | c |")
  (displayln "|--")
  (for ([i (in-range 10)])
    (displayln (format "| ~a | ~a | ~a |" (->cur (* 111 i)) (->cur (* 1123 i))
                       (number->string (->cur (* 2321 i))))))
#+END_SRC

#+RESULTS:
|    a |      b |      c |
|------+--------+--------|
|  0.0 |    0.0 |    0.0 |
| 1.11 |  11.23 |  23.21 |
| 2.22 |  22.46 |  46.42 |
| 3.33 |  33.69 |  69.63 |
| 4.44 |  44.92 |  92.84 |
| 5.55 |  56.15 | 116.05 |
| 6.66 |  67.38 | 139.26 |
| 7.77 |  78.61 | 162.47 |
| 8.88 |  89.84 | 185.68 |
| 9.99 | 101.07 | 208.89 |

